# MaximumDistance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..MaximumDistance Property
DividedPath Class See Also
---
The maximum distance is used when the layout is set to 'MaximumSpacing'. When that layout rule is used the distance between points will not exceed this value. The measurement type determines how the distance is measured.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MaximumDistance { get; set; }
```

Visual Basic
---
```text
Public Property MaximumDistance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MaximumDistance {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The maximumDistance is too small. |

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace